tutorials/CaseMgSO4JSM/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     centriMembSolver;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          5e-3;

writeControl    adjustableRunTime;

writeInterval   5e-3;

purgeWrite      0;

writeFormat       ascii;
writeCompression on;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo 0.2;
maxDeltaT 0.1;

libs ("libGamaPatchAvgTimeWindow.so");


functions
{
    #includeFunc CourantNo;

   GamaPatchAvgTimeWindow1
    {
        type        GamaPatchAvgTimeWindow;

        // --- settings ---
        patchName   membrane;
        fieldName   Gama;
        timeWindow  30;

        // --- output control ---
        writeControl timeStep;
        writeInterval 10;
        log         true;

        // optional naming
        outputName  Gama_membrane_avgWin;
        fileName    areaAvg_timeWindow.dat;
    }
}


// ************************************************************************* //
