tutorials/CaseMgSO4JSM/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out files of streamlines with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

direction       both;

seedSampleSet
{
    type            lineUniform;
    start           (0 0.5 0);
    end             (9 0.5 0);
    nPoints         24;
    axis            x;
}

fields          (U);

#includeEtc "caseDicts/postProcessing/visualization/streamlines.cfg"

// ************************************************************************* //
