tutorials/CaseMgSO4JSM/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
name    c0;
actions
(
    {
        name    membraneFaces;
        type    faceSet;
        action  new;

        source  patchToFace;
        
        sourceInfo
        {
            patch   membrane;
        };
    }
    
    {
        name    nearMembrane;
        type    cellSet;
        action  new;

        source  faceToCell;
        
        sourceInfo
        {
            name    membraneFaces;
            option  any;          // Selects any cell using the face
            outside false;        // false means select the cells inside
        };
    }
);
